posts/reading/patterns-enterprise-application-architecture/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Patterns of Enterprise Application Architecture | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/patterns-enterprise-application-architecture/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../play-for-scala/" title="Play for Scala" type="text/html">
<link rel="next" href="../lean-python/" title="Lean Python" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Patterns of Enterprise Application Architecture">
<meta property="og:url" content="https://example.com/posts/reading/patterns-enterprise-application-architecture/">
<meta property="og:description" content="Table of Contents


Layering
Organizing Domain Logic





Layering


Higher layer uses various services defined by the lower layer, but
the lower layer is unaware of the higher layer.

Each layer usua">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="patterns">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Patterns of Enterprise Application Architecture</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Layering</a></li>
<li><a href="#sec-2">Organizing Domain Logic</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Layering</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Higher layer uses various services defined by the lower layer, but
the lower layer is unaware of the higher layer.
</li>
<li>Each layer usually hides its lower layers from the layers above. But
not all layering architectures are opaque like this, but most are,
or rather <i>most are mostly opaque</i>.
</li>
<li>Some downsides:
<ul class="org-ul">
<li>Layers encapsulate some, but not all, things well. As a result you
sometimes get cascading changes.
<ul class="org-ul">
<li>Classical example is adding a field that needs to display on the
UI, must be in the database, and thus must be added to every
layer in between.
</li>
</ul>
</li>
<li>Extra layers can harm performance.
<ul class="org-ul">
<li>At every layer things typically need to be transformed from one
representation to another.
</li>
<li>However, the encapsulation of an underlying function often gives
you efficiency gains that more than compensate.
</li>
</ul>
</li>
</ul>
</li>
<li>Sometime the layers are arranged so that the domain layer completely
hides the data source from the presentation. More often, however,
the presentation accesses the data store directly.
<ul class="org-ul">
<li>Less pure but tends to work better in practice.
</li>
</ul>
</li>
<li>Three principal layers:
<dl class="org-dl">
<dt> Presentation </dt>
<dd>provision of services, display of information,
handling of user request.
</dd>
<dt> Domain </dt>
<dd>Logic that is the real point of the system.
</dd>
<dt> Data Source </dt>
<dd>Communication with databases, messaging systems,
transaction managers, and other packages.
</dd>
</dl>
</li>
<li>Rules of dependencies
<ul class="org-ul">
<li>The domain and data source should never be dependent on the presentation.
</li>
<li>Avoid leaking domain logic to presentation layer.
</li>
<li>However, it is often done it this way to be practical.
</li>
</ul>
</li>
<li>With webservice and alike, the user is the client program.
<ul class="org-ul">
<li>At this point it becomes apparent that there is a lot of
similarity between the presentation and data source layers in that
they both are about <i>connection to the outside world</i>.
</li>
<li>
<b>Hexagonal Architecture</b> pattern, which visualizes any system as a
core surrounded by interfaces to external systems.
</li>
<li>In <b>Hexagonal Architecture</b> everything external is fundamentally
an outside interface, and thus it is a <i>symmetrical</i> view rather
than an <i>asymmetric</i> layering scheme.
</li>
<li>The asymmetric view may be useful in that it is a good distinction
between an interface that you provide as a service to others and
your use of someone else's service.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Organizing Domain Logic</h2>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/patterns/" rel="tag">patterns</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../play-for-scala/" rel="prev" title="Play for Scala">Previous post</a>
            </li>
            <li class="next">
                <a href="../lean-python/" rel="next" title="Lean Python">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
